piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_rst_clk.c
/**
 *******************************************************************************
 * @file    MDR32F2xQI_rst_clk.c
 * @author  Milandr Application Team
 * @version V1.0.0
 * @date    19/05/2023
 * @brief   This file contains all the RST_CLK firmware functions.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "MDR32F2xQI_rst_clk.h"

/** @addtogroup __MDR32F2xQI_StdPeriph_Driver MDR32F2xQI Standard Peripherial Driver
 * @{
 */

/** @defgroup RST_CLK RST_CLK
 * @{
 */

/** @defgroup RST_CLK_Exported_Functions RST_CLK Exported Functions
 * @{
 */

/**
 * @brief  Set the RST_CLK clock configuration to the default reset state.
 * @param  None.
 * @retval None.
 */
void RST_CLK_DeInit(void)
{
    /* Reset all peripheral clock but RST_CLK and BKP_CLK */
    MDR_RST_CLK->PER2_CLOCK = (RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK | RST_CLK_PER2_CLOCK_PCLK_EN_BKP);

    /* Enable HSI in BKP because RST_CLK deinitialization will change HCLK source to HSI */
    MDR_BKP->REG_0F |= BKP_REG_0F_HSI_ON;

    /* Wait HSI ready */
    while ((MDR_BKP->REG_0F & BKP_REG_0F_HSI_RDY) == RESET) { }

    /* Reset CPU_CLOCK bits - HSI is selected as HCLK */
    MDR_RST_CLK->CPU_CLOCK = (uint32_t)0x00000000;

    /* Reset SELECTRI and LOW bits in BKP */
    MDR_BKP->REG_0E &= ~(BKP_REG_0E_SELECTRI_Msk | BKP_REG_0E_LOW_Msk);

    /* Reset all peripheral clock but RST_CLK */
    MDR_RST_CLK->PER2_CLOCK = RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK;

    MDR_RST_CLK->PLL_CONTROL = (uint32_t)0x00000000;
    MDR_RST_CLK->HS_CONTROL  = (uint32_t)0x00000000;
    MDR_RST_CLK->ADC_CLOCK   = (uint32_t)0x00000000;
    MDR_RST_CLK->RTC_CLOCK   = (uint32_t)0x00000000;

#if defined(USE_MDR32F21QI)
    /* Reset all but DMA_EN and DEBUG_EN bits */
    MDR_RST_CLK->PER1_CLOCK = (RST_CLK_PER1_CLOCK_DMA_EN | RST_CLK_PER1_CLOCK_DEBUG_EN);
#elif defined(USE_MDR32F23QI)
    /* Reset all but DEBUG_EN bits */
    MDR_RST_CLK->PER1_CLOCK = RST_CLK_PER1_CLOCK_DEBUG_EN;
#endif

    MDR_RST_CLK->TIM_CLOCK  = (uint32_t)0x00000000;
    MDR_RST_CLK->UART_CLOCK = (uint32_t)0x00000000;
    MDR_RST_CLK->SSP_CLOCK  = (uint32_t)0x00000000;
}

/**
 * @brief  HSE (High Speed External) clock mode and source selection.
 * @param  HSE_Mode - @ref RST_CLK_HSE_Mode_TypeDef - mode selector.
 * @retval None.
 */
void RST_CLK_HSE_Config(RST_CLK_HSE_Mode_TypeDef HSE_Mode)
{
    /* Check the parameters */
    assert_param(IS_RST_CLK_HSE(HSE_Mode));

    /* Reset HSEON and HSEBYP bits before configuring the HSE */
    MDR_RST_CLK->HS_CONTROL &= ~(RST_CLK_HS_CONTROL_HSE_ON | RST_CLK_HS_CONTROL_HSE_BYP);

    MDR_RST_CLK->HS_CONTROL |= (uint32_t)HSE_Mode;
}

/**
 * @brief  Get HSE clock status.
 * @param  None.
 * @retval @ref ErrorStatus - SUCCESS if HSE clock is ready, else ERROR.
 */
ErrorStatus RST_CLK_HSE_GetStatus(void)
{
    __IO uint32_t StartCounter = 0;
    ErrorStatus   State;
    FlagStatus    Flag;

    /* Wait until HSE is ready or time out is occurred */
    do {
        Flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_HSERDY);
        StartCounter++;
    } while ((StartCounter < HSERDY_TIMEOUT_TICK) && (Flag == RESET));

    if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_HSERDY) != RESET) {
        State = SUCCESS;
    } else {
        State = ERROR;
    }

    return State;
}

/**
 * @brief  Configures the CPU_PLL clock source and multiplication factor.
 * @param  PLLCPU_Source - @ref RST_CLK_PLLCPU_Source_TypeDef - specifies the PLL entry clock source.
 * @param  PLLCPU_Multiplier - @ref RST_CLK_PLLCPU_Multiplier_TypeDef - specifies the PLL multiplication factor.
 * @retval None.
 */
void RST_CLK_CPU_PLL_Config(RST_CLK_PLLCPU_Source_TypeDef PLLCPU_Source, uint32_t PLLCPU_Multiplier)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_PLLCPU_SOURCE(PLLCPU_Source));
    assert_param(IS_RST_CLK_PLLCPU_MUL(PLLCPU_Multiplier));

    /* Select CPUPLL source */
    Temp = MDR_RST_CLK->CPU_CLOCK;
    /* Clear CPU_C1_SEL bits */
    Temp &= ~RST_CLK_CPU_CLOCK_CPU_C1_SEL_Msk;
    /* Set the CPU_C1_SEL bits */
    Temp |= PLLCPU_Source;
    /* Store the new value */
    MDR_RST_CLK->CPU_CLOCK = Temp;

    /* Set CPUPLL multiplier */
    Temp = MDR_RST_CLK->PLL_CONTROL;
    /* Clear PLLMUL[3:0] bits */
    Temp &= ~RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Msk;
    /* Set the PLLMUL[3:0] bits */
    Temp |= (PLLCPU_Multiplier << RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos);
    /* Store the new value */
    MDR_RST_CLK->PLL_CONTROL = Temp;

    /* Reload PLL if it was already in use */
    if ((MDR_RST_CLK->PLL_CONTROL & RST_CLK_PLL_CONTROL_PLL_CPU_ON) != 0) {
        Temp = MDR_RST_CLK->PLL_CONTROL;
        Temp |= RST_CLK_PLL_CONTROL_PLL_CPU_RLD;
        MDR_RST_CLK->PLL_CONTROL = Temp;
        Temp &= ~RST_CLK_PLL_CONTROL_PLL_CPU_RLD;
        MDR_RST_CLK->PLL_CONTROL = Temp;
    }
}

/**
 * @brief  Enables or disables the CPU_PLL.
 * @param  NewState - @ref FunctionalState - new state of the CPU_PLL.
 * @retval None.
 */
void RST_CLK_CPU_PLL_Cmd(FunctionalState NewState)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    Temp = MDR_RST_CLK->PLL_CONTROL;

    if (NewState != DISABLE) {
        Temp |= RST_CLK_PLL_CONTROL_PLL_CPU_ON;
    } else {
        Temp &= ~RST_CLK_PLL_CONTROL_PLL_CPU_ON;
    }

    MDR_RST_CLK->PLL_CONTROL = Temp;
}

/**
 * @brief  Get CPU_PLL status.
 * @param  None.
 * @retval @ref ErrorStatus - SUCCESS if CPU_PLL output clock is ready, else ERROR.
 */
ErrorStatus RST_CLK_CPU_PLL_GetStatus(void)
{
    __IO uint32_t StartCounter = 0;
    ErrorStatus   State;
    FlagStatus    Flag;

    /* Wait until CPUPLL is ready or time out is occurred */
    do {
        Flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLCPURDY);
        StartCounter++;
    } while ((StartCounter < PLLCPURDY_TIMEOUT_TICK) && (Flag == RESET));

    if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLCPURDY) != RESET) {
        State = SUCCESS;
    } else {
        State = ERROR;
    }

