piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_rst_clk.c
    return State;
}

/**
 * @brief  Select the CPU_C1 clock source.
 * @param  CPU_C1_Source - @ref RST_CLK_CPU_C1_Source_TypeDef - specifies the CPU_C1 clock source.
 * @retval None.
 */
void RST_CLK_CPU_C1_ClkSelection(RST_CLK_CPU_C1_Source_TypeDef CPU_C1_Source)
{
    uint32_t Temp = 0;

    /* Check the parameters */
    assert_param(IS_RST_CLK_CPU_C1_SOURCE(CPU_C1_Source));

    Temp = MDR_RST_CLK->CPU_CLOCK;

    /* Clear CPU_C3_SEL bits */
    Temp &= ~RST_CLK_CPU_CLOCK_CPU_C1_SEL_Msk;

    /* Set the CPU_C3_SEL bits */
    Temp |= (uint32_t)CPU_C1_Source;

    /* Store the new value */
    MDR_RST_CLK->CPU_CLOCK = Temp;
}

/**
 * @brief  Select the CPU_C2 clock source.
 * @param  CPU_C2_Source - @ref RST_CLK_CPU_C2_Source_TypeDef - specifies CPU_C2 clock source.
 * @retval None.
 */
void RST_CLK_CPU_C2_ClkSelection(RST_CLK_CPU_C2_Source_TypeDef CPU_C2_Source)
{
    uint32_t Temp = 0;

    /* Check the parameters */
    assert_param(IS_RST_CLK_CPU_C2_SOURCE(CPU_C2_Source));

    Temp = MDR_RST_CLK->CPU_CLOCK;
    Temp &= ~RST_CLK_CPU_CLOCK_CPU_C2_SEL_Msk;
    Temp |= (uint32_t)CPU_C2_Source;

    /* Configure CPU_CLOCK register with new value */
    MDR_RST_CLK->CPU_CLOCK = Temp;
}

/**
 * @brief  Сonfigures the CPU_C3_SEL division factor switch.
 * @param  CPU_CLK_DivValue - @ref RST_CLK_CPU_C3_Prescaler_TypeDef - specifies the CPU_PLL clock division factor.
 * @retval None.
 */
void RST_CLK_CPU_C3_SetPrescaler(RST_CLK_CPU_C3_Prescaler_TypeDef CPU_CLK_DivValue)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_CPU_C3_DIV(CPU_CLK_DivValue));

    Temp = MDR_RST_CLK->CPU_CLOCK;

    /* Clear CPU_C3_SEL bits */
    Temp &= ~RST_CLK_CPU_CLOCK_CPU_C3_SEL_Msk;

    /* Set the CPU_C3_SEL bits */
    Temp |= (uint32_t)CPU_CLK_DivValue;

    /* Store the new value */
    MDR_RST_CLK->CPU_CLOCK = Temp;
}

/**
 * @brief  Select the HCLK clock source.
 * @param  CPU_HCLK_Source - @ref RST_CLK_HCLK_Source_TypeDef - specifies the HCLK clock source.
 * @retval None.
 */
void RST_CLK_HCLK_ClkSelection(RST_CLK_HCLK_Source_TypeDef CPU_HCLK_Source)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_HCLK_SOURCE(CPU_HCLK_Source));

    Temp = MDR_RST_CLK->CPU_CLOCK;

    /* Clear CPU_C3_SEL bits */
    Temp &= ~RST_CLK_CPU_CLOCK_HCLK_SEL_Msk;

    /* Set the CPU_C3_SEL bits */
    Temp |= (uint32_t)CPU_HCLK_Source;

    /* Store the new value */
    MDR_RST_CLK->CPU_CLOCK = Temp;
}

/**
 * @brief  Select the ADC clock source.
 * @param  ADC_CLK_Source - @ref RST_CLK_ADC_Source_TypeDef - specifies the ADC_C2 clock source.
 * @retval None.
 */
void RST_CLK_ADC_ClkSelection(RST_CLK_ADC_Source_TypeDef ADC_CLK_Source)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_ADC_CLK_SOURCE(ADC_CLK_Source));

    /* Select ADC_CLK source */
    Temp = MDR_RST_CLK->ADC_CLOCK;

    /* Clear ADC_C1,C2 SEL bits */
    Temp &= ~(RST_CLK_ADC_CLOCK_ADC_C1_SEL_Msk);

    /* Set the ADC_C1, SEL bits */
    Temp |= (uint32_t)ADC_CLK_Source;

    /* Store the new value */
    MDR_RST_CLK->ADC_CLOCK = Temp;
}

/**
 * @brief  Сonfigures the ADC_C3_SEL division factor switch.
 * @param  ADC_CLK_DivValue - @ref RST_CLK_ADC_C3_Divisor_TypeDef - specifies the ADC_C2 clock division factor.
 * @retval None.
 */
void RST_CLK_ADC_SetPrescaler(RST_CLK_ADC_C3_Prescaler_TypeDef ADC_CLK_DivValue)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_ADC_C3_DIV(ADC_CLK_DivValue));

    Temp = MDR_RST_CLK->ADC_CLOCK;

    /* Clear ADC_C3_SEL bits */
    Temp &= ~RST_CLK_ADC_CLOCK_ADC_C3_SEL_Msk;

    /* Set the ADC_C3_SEL bits */
    Temp |= (uint32_t)ADC_CLK_DivValue;

    /* Store the new value */
    MDR_RST_CLK->ADC_CLOCK = Temp;
}

/**
 * @brief  Enables or disables the ADC_CLK clock.
 * @param  NewState - @ref FunctionalState - new state of the ADC_CLK.
 * @retval None.
 */
void RST_CLK_ADC_ClkCmd(FunctionalState NewState)
{
    uint32_t Temp = 0;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    Temp = MDR_RST_CLK->ADC_CLOCK;

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable the ADC CLK by setting the ADC_CLK_EN bit in the ADC_CLOCK register */
        Temp |= RST_CLK_ADC_CLOCK_ADC_CLK_EN;
    } else {
        /* Disable the ADC CLK by resetting the ADC_CLK_EN bit in the ADC_CLOCK register */
        Temp &= ~RST_CLK_ADC_CLOCK_ADC_CLK_EN;
    }

    /* Configure CPU_CLOCK register with new value */
    MDR_RST_CLK->ADC_CLOCK = Temp;
}

/**
 * @brief  Set the RST_CLK_ADCUI clock configuration to the default reset state.
 * @param  None.
 * @retval None.
 */
void RST_CLK_ADCUI_ClkDeInit(void)
{
    MDR_RST_CLK->ADC_CLOCK &= ~(RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Msk |
                                RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Msk |
                                RST_CLK_ADC_CLOCK_ADCUI_CLK_EN);
}

/**
 * @brief  Select the ADCUI clock source.
 * @param  ADCUI_CLK_C1_Source - @ref RST_CLK_ADCUI_Source_TypeDef - specifies the ADCUI_C1 clock source.
 * @retval None.
 */
void RST_CLK_ADCUI_ClkSelection(RST_CLK_ADCUI_Source_TypeDef ADCUI_CLK_C1_Source)
{
    uint32_t Temp = 0;

    /* Check the parameters */
    assert_param(IS_RST_CLK_ADCUI_CLK_SOURCE(ADCUI_CLK_C1_Source));

    /* Select ADC_CLK source */
    Temp = MDR_RST_CLK->ADC_CLOCK;

    /* Clear ADCUI_C1,C2 SEL bits */
    Temp &= ~RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Msk;

    /* Set the ADCUI_C1 SEL bits */
    Temp |= (uint32_t)ADCUI_CLK_C1_Source;

    /* Store the new value */
    MDR_RST_CLK->ADC_CLOCK = Temp;
}

/**
 * @brief  Configures the ADCUI_C3_SEL division factor switch.
 * @param  ADCUI_CLK_DivValue - @ref RST_CLK_ADCUI_C3_Prescaler_TypeDef - specifies the ADCUI clock division factor.
 * @retval None.
 */
void RST_CLK_ADCUI_SetPrescaler(RST_CLK_ADCUI_C3_Prescaler_TypeDef ADCUI_CLK_DivValue)
{
    uint32_t Temp = 0;

    /* Check the parameters */
    assert_param(IS_RST_CLK_ADCUI_C3_DIV(ADCUI_CLK_DivValue));

    Temp = MDR_RST_CLK->ADC_CLOCK;

