piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_rst_clk.c
    /* Clear ADCUI_C3_SEL bits */
    Temp &= ~RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Msk;

    /* Set the ADCUI_C3_SEL bits */
    Temp |= (uint32_t)ADCUI_CLK_DivValue;

    /* Store the new value */
    MDR_RST_CLK->ADC_CLOCK = Temp;
}

/**
 * @brief  Enables or disables the ADCUI clk.
 * @param  NewState - @ref FunctionalState - new state of the ADCUI clk.
 * @retval None.
 */
void RST_CLK_ADCUI_ClkCmd(FunctionalState NewState)
{
    uint32_t Temp = 0;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    Temp = MDR_RST_CLK->ADC_CLOCK;

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable ADCUI clk by setting the ADCUI_CLK_EN bit in the ADC_CLOCK register */
        Temp |= RST_CLK_ADC_CLOCK_ADCUI_CLK_EN;
    } else {
        /* Disable ADCUI clk by resetting the ADCUI_CLK_EN bit in the ADC_CLOCK register */
        Temp &= ~RST_CLK_ADC_CLOCK_ADCUI_CLK_EN;
    }

    /* Configure ADC_CLOCK register with new value */
    MDR_RST_CLK->ADC_CLOCK = Temp;
}

/**
 * @brief  Configures the HSI_C1_SEL division factor switch.
 * @param  HSI_CLK_DivValue - @ref RST_CLK_HSI_C1_Prescaler_TypeDef - specifies the HSI clock division factor.
 * @retval None.
 */
void RST_CLK_HSI_C1_SetPrescaler(RST_CLK_HSI_C1_Prescaler_TypeDef HSI_CLK_DivValue)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_HSI_CLK_DIV(HSI_CLK_DivValue));

    Temp = MDR_RST_CLK->RTC_CLOCK;

    /* Clear HSI_SEL bits */
    Temp &= ~RST_CLK_RTC_CLOCK_HSI_SEL_Msk;

    /* Set the HSI_SEL bits */
    Temp |= (uint32_t)HSI_CLK_DivValue;

    /* Store the new value */
    MDR_RST_CLK->RTC_CLOCK = Temp;
}

/**
 * @brief  Enables or disables the RTCHSI clock.
 * @param  NewState - @ref FunctionalState - new state of the HSI_RTC_EN.
 * @retval None.
 */
void RST_CLK_RTC_HSI_ClkCmd(FunctionalState NewState)
{
    uint32_t Temp = 0;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    Temp = MDR_RST_CLK->RTC_CLOCK;

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable HSI RTC clk by setting the HSE_RTC_EN bit in the RTC_CLOCK register */
        Temp |= RST_CLK_RTC_CLOCK_HSI_RTC_EN;
    } else {
        /* Disable HSI RTC clk by resetting the HSE_RTC_EN bit in the RTC_CLOCK register */
        Temp &= ~RST_CLK_RTC_CLOCK_HSI_RTC_EN;
    }

    /* Configure RTC_CLOCK register with new value */
    MDR_RST_CLK->RTC_CLOCK = Temp;
}

/**
 * @brief  Configures the HSE_C1_SEL division factor switch.
 * @param  HSE_CLK_DivValue - @ref RST_CLK_HSE_C1_Prescaler_TypeDef - specifies the HSE clock division factor.
 * @retval None.
 */
void RST_CLK_HSE_C1_SetPrescaler(RST_CLK_HSE_C1_Prescaler_TypeDef HSE_CLK_DivValue)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_HSE_CLK_DIV(HSE_CLK_DivValue));

    Temp = MDR_RST_CLK->RTC_CLOCK;

    /* Clear HSE_SEL bits */
    Temp &= ~RST_CLK_RTC_CLOCK_HSE_SEL_Msk;

    /* Set the HSE_SEL bits */
    Temp |= (uint32_t)HSE_CLK_DivValue;

    /* Store the new value */
    MDR_RST_CLK->RTC_CLOCK = Temp;
}

/**
 * @brief  Enables or disables the RTCHSE clock.
 * @param  NewState - @ref FunctionalState - new state of the HSE_RTC_EN.
 * @retval None.
 */
void RST_CLK_RTC_HSE_ClkCmd(FunctionalState NewState)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    Temp = MDR_RST_CLK->RTC_CLOCK;

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable HSI RTC clk by setting the HSE_RTC_EN bit in the RTC_CLOCK register */
        Temp |= RST_CLK_RTC_CLOCK_HSE_RTC_EN;
    } else {
        /* Disable HSI RTC clk by resetting the HSE_RTC_EN bit in the RTC_CLOCK register */
        Temp &= ~RST_CLK_RTC_CLOCK_HSE_RTC_EN;
    }

    /* Configure RTC_CLOCK register with new value */
    MDR_RST_CLK->RTC_CLOCK = Temp;
}

/**
 * @brief  Select the clock source for PER1_C1.
 * @param  PER1_C1_Source - @ref RST_CLK_PER1_C1_TypeDef - specifies the PER1_C1 clock source.
 * @retval None.
 */
void RST_CLK_PER1_C1_ClkSelection(RST_CLK_PER1_C1_TypeDef PER1_C1_Source)
{
    /* Check the parameters */
    assert_param(IS_RST_CLK_PER1_C1_CLK_SOURCE(PER1_C1_Source));

    /* Clear old clock source and set new one */
    MDR_RST_CLK->PER1_CLOCK = (MDR_RST_CLK->PER1_CLOCK & (~RST_CLK_PER1_CLOCK_C1_SEL_Msk)) | (uint32_t)PER1_C1_Source;
}

#if defined(USE_MDR32F21QI)
/**
 * @brief  Select the clock source for PER1_C2.
 * @param  PER1_C2_Source - @ref RST_CLK_PER1_C2_TypeDef - specifies the PER1_C2 clock source.
 * @retval None.
 */
void RST_CLK_PER1_C2_ClkSelection(RST_CLK_PER1_C2_TypeDef PER1_C2_Source)
{
    /* Check the parameters */
    assert_param(IS_RST_CLK_PER1_C2_CLK_SOURCE(PER1_C2_Source));

    MDR_RST_CLK->PER1_CLOCK = (MDR_RST_CLK->PER1_CLOCK & (~RST_CLK_PER1_CLOCK_C2_SEL_Msk)) |
                              ((uint32_t)PER1_C2_Source << RST_CLK_PER1_CLOCK_C2_SEL_Pos);
}

#elif defined(USE_MDR32F23QI)
/**
 * @brief  Select the clock source for PER1_C2_X.
 * @param  PER1_CLK - @ref RST_CLK_PER1_C2_X_TypeDef - peripheral selection.
 * @param  PER1_C2_Source - @ref RST_CLK_PER1_C2_TypeDef - specifies the PER1_C2 clock source.
 * @retval None.
 */
void RST_CLK_PER1_C2_ClkSelection(RST_CLK_PER1_C2_X_TypeDef PER1_CLK, RST_CLK_PER1_C2_TypeDef PER1_C2_Source)
{
    /* Check the parameters */
    assert_param(IS_RST_CLK_PER1_CLK(PER1_CLK));
    assert_param(IS_RST_CLK_PER1_C2_CLK_SOURCE(PER1_C2_Source));

    switch (PER1_CLK) {
        case RST_CLK_PER1_C2_TIM0:
            MDR_RST_CLK->PER1_CLOCK = (MDR_RST_CLK->PER1_CLOCK & (~RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Msk)) |
                                      ((uint32_t)PER1_C2_Source << RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Pos);
            break;
        case RST_CLK_PER1_C2_TIM1:
            MDR_RST_CLK->PER1_CLOCK = (MDR_RST_CLK->PER1_CLOCK & (~RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Msk)) |
                                      ((uint32_t)PER1_C2_Source << RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Pos);
            break;
        case RST_CLK_PER1_C2_UART0:
            MDR_RST_CLK->PER1_CLOCK = (MDR_RST_CLK->PER1_CLOCK & (~RST_CLK_PER1_CLOCK_UART0_C2_SEL_Msk)) |
                                      ((uint32_t)PER1_C2_Source << RST_CLK_PER1_CLOCK_UART0_C2_SEL_Pos);
            break;
        case RST_CLK_PER1_C2_UART1:
            MDR_RST_CLK->PER1_CLOCK = (MDR_RST_CLK->PER1_CLOCK & (~RST_CLK_PER1_CLOCK_UART1_C2_SEL_Msk)) |
                                      ((uint32_t)PER1_C2_Source << RST_CLK_PER1_CLOCK_UART1_C2_SEL_Pos);
            break;
        case RST_CLK_PER1_C2_SSP:
            MDR_RST_CLK->PER1_CLOCK = (MDR_RST_CLK->PER1_CLOCK & (~RST_CLK_PER1_CLOCK_SSP_C2_SEL_Msk)) |
                                      ((uint32_t)PER1_C2_Source << RST_CLK_PER1_CLOCK_SSP_C2_SEL_Pos);
            break;
    }
}
#endif

/**
 * @brief  Configures division factor switch for @ref RST_CLK_PER1_C2_X_TypeDef peripheral.
 * @param  PER1_CLK - @ref RST_CLK_PER1_C2_X_TypeDef - peripheral selection.
 * @param  PER1_C2_DivValue - @ref RST_CLK_PER1_C2_Prescaler_TypeDef - specifies prescaler.
 * @retval None.
 */
void RST_CLK_PER1_C2_SetPrescaler(RST_CLK_PER1_C2_X_TypeDef PER1_CLK, RST_CLK_PER1_C2_Prescaler_TypeDef PER1_C2_DivValue)
{
    /* Check the parameters */
    assert_param(IS_RST_CLK_PER1_CLK(PER1_CLK));
    assert_param(IS_RST_CLK_PER1_C2_DIV(PER1_C2_DivValue));

    switch (PER1_CLK) {
        case RST_CLK_PER1_C2_TIM0:
            MDR_RST_CLK->TIM_CLOCK = (MDR_RST_CLK->TIM_CLOCK & (~RST_CLK_TIM_CLOCK_TIM0_BRG_Msk)) |
                                     ((uint32_t)PER1_C2_DivValue << RST_CLK_TIM_CLOCK_TIM0_BRG_Pos);
            break;
        case RST_CLK_PER1_C2_TIM1:
            MDR_RST_CLK->TIM_CLOCK = (MDR_RST_CLK->TIM_CLOCK & (~RST_CLK_TIM_CLOCK_TIM1_BRG_Msk)) |
                                     ((uint32_t)PER1_C2_DivValue << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos);
            break;
        case RST_CLK_PER1_C2_UART0:
            MDR_RST_CLK->UART_CLOCK = (MDR_RST_CLK->UART_CLOCK & (~RST_CLK_UART_CLOCK_UART0_BRG_Msk)) |
                                      ((uint32_t)PER1_C2_DivValue << RST_CLK_UART_CLOCK_UART0_BRG_Pos);
            break;
        case RST_CLK_PER1_C2_UART1:
            MDR_RST_CLK->UART_CLOCK = (MDR_RST_CLK->UART_CLOCK & (~RST_CLK_UART_CLOCK_UART1_BRG_Msk)) |
                                      ((uint32_t)PER1_C2_DivValue << RST_CLK_UART_CLOCK_UART1_BRG_Pos);
            break;
        case RST_CLK_PER1_C2_SSP:
            MDR_RST_CLK->SSP_CLOCK = (MDR_RST_CLK->SSP_CLOCK & (~RST_CLK_SSP_CLOCK_SSP_BRG_Msk)) |
                                     ((uint32_t)PER1_C2_DivValue << RST_CLK_SSP_CLOCK_SSP_BRG_Pos);
            break;
    }
}

/**
 * @brief  Enables or disables @ref RST_CLK_PER1_C2_X_TypeDef peripheral clock.
 * @param  PER1_CLK - @ref RST_CLK_PER1_C2_X_TypeDef - peripheral selection.
 * @param  NewState - @ref FunctionalState - new state of the peripheral clock.
 * @retval None.
 */
void RST_CLK_PER1_C2_Cmd(RST_CLK_PER1_C2_X_TypeDef PER1_CLK, FunctionalState NewState)
{
    uint32_t Temp;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    switch (PER1_CLK) {
        case RST_CLK_PER1_C2_TIM0:
            Temp = (MDR_RST_CLK->TIM_CLOCK & (~RST_CLK_TIM_CLOCK_TIM0_CLK_EN_Msk));
            Temp |= ((uint32_t)NewState << RST_CLK_TIM_CLOCK_TIM0_CLK_EN_Pos);
            MDR_RST_CLK->TIM_CLOCK = Temp;
            break;
        case RST_CLK_PER1_C2_TIM1:
            Temp = (MDR_RST_CLK->TIM_CLOCK & (~RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Msk));
            Temp |= ((uint32_t)NewState << RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Pos);
            MDR_RST_CLK->TIM_CLOCK = Temp;
            break;
        case RST_CLK_PER1_C2_UART0:
            Temp = (MDR_RST_CLK->UART_CLOCK & (~RST_CLK_UART_CLOCK_UART0_CLK_EN_Msk));
            Temp |= ((uint32_t)NewState << RST_CLK_UART_CLOCK_UART0_CLK_EN_Pos);
            MDR_RST_CLK->UART_CLOCK = Temp;
            break;
        case RST_CLK_PER1_C2_UART1:
            Temp = (MDR_RST_CLK->UART_CLOCK & (~RST_CLK_UART_CLOCK_UART1_CLK_EN_Msk));
            Temp |= ((uint32_t)NewState << RST_CLK_UART_CLOCK_UART1_CLK_EN_Pos);
            MDR_RST_CLK->UART_CLOCK = Temp;
            break;
        case RST_CLK_PER1_C2_SSP:
            Temp = (MDR_RST_CLK->SSP_CLOCK & (~RST_CLK_SSP_CLOCK_SSP_CLK_EN_Msk));
            Temp |= ((uint32_t)NewState << RST_CLK_SSP_CLOCK_SSP_CLK_EN_Pos);
            MDR_RST_CLK->SSP_CLOCK = Temp;
            break;
    }
}

