piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_rst_clk.c
#if defined(USE_MDR32F21QI)
/**
 * @brief  Set the DMA clock state.
 * @param  NewState - @ref FunctionalState - new state of the DMA clock.
 * @retval None.
 */
void RST_CLK_DMACmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        MDR_RST_CLK->PER1_CLOCK |= RST_CLK_PER1_CLOCK_DMA_EN;
    } else {
        MDR_RST_CLK->PER1_CLOCK &= ~RST_CLK_PER1_CLOCK_DMA_EN;
    }
}

/**
 * @brief  Get the DMA clock state.
 * @param  None.
 * @retval @ref FunctionalState - the state of the DMA clock.
 */
FunctionalState RST_CLK_DMAState(void)
{
    FunctionalState dma_state;

    if (MDR_RST_CLK->PER1_CLOCK & RST_CLK_PER1_CLOCK_DMA_EN) {
        dma_state = ENABLE;
    } else {
        dma_state = DISABLE;
    }

    return (FunctionalState)dma_state;
}
#endif

/**
 * @brief  Set the DEBUG clock state.
 * @param  NewState - @ref FunctionalState - new state of the DEBUG clock.
 * @retval None.
 */
void RST_CLK_DEBUGCmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        MDR_RST_CLK->PER1_CLOCK |= RST_CLK_PER1_CLOCK_DEBUG_EN;
    } else {
        MDR_RST_CLK->PER1_CLOCK &= ~RST_CLK_PER1_CLOCK_DEBUG_EN;
    }
}

/**
 * @brief  Get the DEBUG clock state.
 * @param  None.
 * @retval @ref FunctionalState - the state of the DEBUG clock.
 */
FunctionalState RST_CLK_DEBUGState(void)
{
    FunctionalState DebugState;

    if (MDR_RST_CLK->PER1_CLOCK & RST_CLK_PER1_CLOCK_DEBUG_EN) {
        DebugState = ENABLE;
    } else {
        DebugState = DISABLE;
    }

    return (FunctionalState)DebugState;
}

/**
 * @brief  Enables or disables clock of peripherals.
 * @param  RST_CLK_PCLK: specifies the peripheral to gates its clock.
 *         This parameter can be any combination of the @ref RST_CLK_PCLK_TypeDef values.
 * @param  NewState - @ref FunctionalState - new state of the specified peripheral clock.
 * @retval None.
 */
void RST_CLK_PCLKCmd(uint32_t RST_CLK_PCLK, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_RST_CLK_PCLK(RST_CLK_PCLK));

    if (NewState != DISABLE) {
        MDR_RST_CLK->PER2_CLOCK |= RST_CLK_PCLK;
    } else {
        MDR_RST_CLK->PER2_CLOCK &= ~RST_CLK_PCLK;
    }
}

/**
 * @brief  Put the frequencies of different on chip clocks in *RST_CLK_Clocks structure.
 * @param  RST_CLK_Clocks: pointer to a @ref RST_CLK_Freq_TypeDef structure that will hold
 *         the clocks frequencies.
 * @retval None.
 */
void RST_CLK_GetClocksFreq(RST_CLK_Freq_TypeDef* RST_CLK_Clocks)
{
    uint32_t CPU_C1_Freq = 0, CPU_C2_Freq = 0, CPU_C3_Freq = 0;
    uint32_t ADC_C1_Freq = 0, ADC_C3_Freq = 0;
    uint32_t ADCUI_C1_Freq = 0, ADCUI_C3_Freq = 0;
    uint32_t HSI_C1_Freq = 0, HSE_C1_Freq = 0;
    uint32_t PER_C1_Freq = 0, PER_C2_Freq = 0;
    uint32_t PLL_Mult = 0;
    uint32_t Temp     = 0;
#if defined(USE_MDR32F23QI)
    uint8_t  i           = 0;
    uint32_t PerMasks[]  = { RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Msk, RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Msk,
                             RST_CLK_PER1_CLOCK_UART0_C2_SEL_Msk, RST_CLK_PER1_CLOCK_UART1_C2_SEL_Msk,
                             RST_CLK_PER1_CLOCK_SSP_C2_SEL_Msk };
    uint32_t PerShifts[] = { RST_CLK_PER1_CLOCK_TIM0_C2_SEL_Pos, RST_CLK_PER1_CLOCK_TIM1_C2_SEL_Pos,
                             RST_CLK_PER1_CLOCK_UART0_C2_SEL_Pos, RST_CLK_PER1_CLOCK_UART1_C2_SEL_Pos,
                             RST_CLK_PER1_CLOCK_SSP_C2_SEL_Pos };
#endif

    /* Check the parameter */
    assert_param(RST_CLK_Clocks != 0);

    /* Compute CPU_CLK, ADC_CLK, ADCUI_CLK, RTCHSI, RTCHSE clocks frequencies */

    /* Compute CPU_CLK frequency */

    Temp = MDR_RST_CLK->CPU_CLOCK;

    /* Determine CPU_C1 frequency */
    switch (Temp & RST_CLK_CPU_CLOCK_CPU_C1_SEL_Msk) {
        case RST_CLK_CPU_C1_SRC_HSI:
            CPU_C1_Freq = HSI_FREQUENCY_Hz;
            break;
        case RST_CLK_CPU_C1_SRC_HSI_DIV_2:
            CPU_C1_Freq = HSI_FREQUENCY_Hz / 2;
            break;
        case RST_CLK_CPU_C1_SRC_HSE:
            CPU_C1_Freq = HSE_FREQUENCY_Hz;
            break;
        case RST_CLK_CPU_C1_SRC_HSE_DIV_2:
            CPU_C1_Freq = HSE_FREQUENCY_Hz / 2;
            break;
    }

    /* Determine CPU_C2 frequency */
    CPU_C2_Freq = CPU_C1_Freq;

    /* Determine CPU PLL output frequency */
    PLL_Mult = ((MDR_RST_CLK->PLL_CONTROL & RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Msk) >> RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos) + 1;

    if (Temp & RST_CLK_CPU_CLOCK_CPU_C2_SEL_Msk) {
        CPU_C2_Freq *= PLL_Mult;
    }

    /* Select CPU_CLK from HSI, CPU_C3, LSE, LSI cases */
    switch (Temp & RST_CLK_CPU_CLOCK_HCLK_SEL_Msk) {
        case RST_CLK_CPU_CLK_HSI:
            RST_CLK_Clocks->CPU_CLK_Frequency = HSI_FREQUENCY_Hz;
            break;
        case RST_CLK_CPU_CLK_CPU_C3:
            /* Determine CPU_C3 frequency */
            Temp = ((Temp & RST_CLK_CPU_CLOCK_CPU_C3_SEL_Msk) >> RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos);
            if ((Temp & 0x8U) == 0x00) {
                CPU_C3_Freq = CPU_C2_Freq;
            } else {
                CPU_C3_Freq = CPU_C2_Freq >> ((Temp & 0x7U) + 1);
            }
            RST_CLK_Clocks->CPU_CLK_Frequency = CPU_C3_Freq;
            break;
        case RST_CLK_CPU_CLK_LSE:
            RST_CLK_Clocks->CPU_CLK_Frequency = LSE_FREQUENCY_Hz;
            break;
        case RST_CLK_CPU_CLK_LSI:
            RST_CLK_Clocks->CPU_CLK_Frequency = LSI_FREQUENCY_Hz;
            break;
    }

    /* Compute RTCHSE_CLK frequency */
    Temp = MDR_RST_CLK->RTC_CLOCK;
    if ((Temp & 0x8U) == 0) {
        HSE_C1_Freq = HSE_FREQUENCY_Hz;
    } else {
        HSE_C1_Freq = HSE_FREQUENCY_Hz >> ((Temp & 0x7U) + 1);
    }
    RST_CLK_Clocks->RTCHSE_Frequency = HSE_C1_Freq;

    /* Compute RTCHSI_CLK frequency */
    Temp >>= RST_CLK_RTC_CLOCK_HSI_SEL_Pos;
    if ((Temp & 0x8U) == 0) {
        HSI_C1_Freq = HSI_FREQUENCY_Hz;
    } else {
        HSI_C1_Freq = HSI_FREQUENCY_Hz >> ((Temp & 0x7U) + 1);
    }
    RST_CLK_Clocks->RTCHSI_Frequency = HSI_C1_Freq;

    /* Determine clock frequency per_c1 */
    Temp = MDR_RST_CLK->PER1_CLOCK;
    switch (Temp & RST_CLK_PER1_CLOCK_C1_SEL_Msk) {
        case RST_CLK_PER1_C1_CLK_SRC_LSI:
            PER_C1_Freq = LSI_FREQUENCY_Hz;
            break;
        case RST_CLK_PER1_C1_CLK_SRC_LSI_DIV_2:
            PER_C1_Freq = LSI_FREQUENCY_Hz / 2;
            break;
        case RST_CLK_PER1_C1_CLK_SRC_LSE:
            PER_C1_Freq = LSE_FREQUENCY_Hz;
            break;
        case RST_CLK_PER1_C1_CLK_SRC_LSE_DIV_2:
            PER_C1_Freq = LSE_FREQUENCY_Hz / 2;
            break;
    }
#if defined(USE_MDR32F21QI)
    /* Determine clock frequency per_c2 */
    switch ((Temp & RST_CLK_PER1_CLOCK_C2_SEL_Msk) >> RST_CLK_PER1_CLOCK_C2_SEL_Pos) {
        case RST_CLK_PER1_C2_CLK_SRC_CPU_C1:
            PER_C2_Freq = CPU_C1_Freq;
            break;
        case RST_CLK_PER1_C2_CLK_SRC_PER1_C1:
            PER_C2_Freq = PER_C1_Freq;
            break;
        case RST_CLK_PER1_C2_CLK_SRC_PLLCPU:
            PER_C2_Freq = CPU_C1_Freq * PLL_Mult;
            break;
        case RST_CLK_PER1_C2_CLK_SRC_HSI_CLK:
            PER_C2_Freq = HSI_FREQUENCY_Hz;
            break;
    }

