piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_rst_clk.c
    RST_CLK_Clocks->TIMER_Frequency[0] = PER_C2_Freq;
    RST_CLK_Clocks->TIMER_Frequency[1] = PER_C2_Freq;
    RST_CLK_Clocks->UART_Frequency[0]  = PER_C2_Freq;
    RST_CLK_Clocks->UART_Frequency[1]  = PER_C2_Freq;
    RST_CLK_Clocks->SSP_Frequency      = PER_C2_Freq;

#elif defined(USE_MDR32F23QI)
    for (i = 0; i < 5; i++) {
        /* Determine clock frequency c2 for TIMERx, UARTx or SSP */
        switch ((Temp & PerMasks[i]) >> PerShifts[i]) {
            case RST_CLK_PER1_C2_CLK_SRC_CPU_C1:
                PER_C2_Freq = CPU_C1_Freq;
                break;
            case RST_CLK_PER1_C2_CLK_SRC_PER1_C1:
                PER_C2_Freq = PER_C1_Freq;
                break;
            case RST_CLK_PER1_C2_CLK_SRC_PLLCPU:
                PER_C2_Freq = CPU_C1_Freq * PLL_Mult;
                break;
            case RST_CLK_PER1_C2_CLK_SRC_HSI_CLK:
                PER_C2_Freq = HSI_FREQUENCY_Hz;
                break;
        }

        switch ((RST_CLK_PER1_C2_X_TypeDef)i) {
            case RST_CLK_PER1_C2_TIM0:
                RST_CLK_Clocks->TIMER_Frequency[0] = PER_C2_Freq >>
                                                     ((MDR_RST_CLK->TIM_CLOCK & RST_CLK_TIM_CLOCK_TIM0_BRG_Msk) >> RST_CLK_TIM_CLOCK_TIM0_BRG_Pos);
                break;
            case RST_CLK_PER1_C2_TIM1:
                RST_CLK_Clocks->TIMER_Frequency[1] = PER_C2_Freq >>
                                                     ((MDR_RST_CLK->TIM_CLOCK & RST_CLK_TIM_CLOCK_TIM1_BRG_Msk) >> RST_CLK_TIM_CLOCK_TIM1_BRG_Pos);
                break;
            case RST_CLK_PER1_C2_UART0:
                RST_CLK_Clocks->UART_Frequency[0] = PER_C2_Freq >>
                                                    ((MDR_RST_CLK->UART_CLOCK & RST_CLK_UART_CLOCK_UART0_BRG_Msk) >> RST_CLK_UART_CLOCK_UART0_BRG_Pos);
                break;
            case RST_CLK_PER1_C2_UART1:
                RST_CLK_Clocks->UART_Frequency[1] = PER_C2_Freq >>
                                                    ((MDR_RST_CLK->UART_CLOCK & RST_CLK_UART_CLOCK_UART1_BRG_Msk) >> RST_CLK_UART_CLOCK_UART1_BRG_Pos);
                break;
            case RST_CLK_PER1_C2_SSP:
                RST_CLK_Clocks->SSP_Frequency = PER_C2_Freq >>
                                                ((MDR_RST_CLK->SSP_CLOCK & RST_CLK_SSP_CLOCK_SSP_BRG_Msk) >> RST_CLK_SSP_CLOCK_SSP_BRG_Pos);
                break;
        }
    }
#endif

    /* Compute ADC_CLK frequency */
    Temp = MDR_RST_CLK->ADC_CLOCK;
    /* Select ADC_C1 from cpu_c1, PER_C1_Freq, CPU_C2_Freq, HSI_C1 cases */
    switch ((Temp & RST_CLK_ADC_CLOCK_ADC_C1_SEL_Msk) >> RST_CLK_ADC_CLOCK_ADC_C1_SEL_Pos) {
        case RST_CLK_ADC_CLK_CPU_C1:
            ADC_C1_Freq = CPU_C1_Freq;
            break;
        case RST_CLK_ADC_CLK_PER1_C1:
            ADC_C1_Freq = PER_C1_Freq;
            break;
        case RST_CLK_ADC_CLK_PLLCPU:
            ADC_C1_Freq = CPU_C2_Freq;
            break;
        case RST_CLK_ADC_CLK_HSI_CLK:
            ADC_C1_Freq = HSI_FREQUENCY_Hz;
            break;
    }
    /* Compute ADC_CLK divisor */
    if (((Temp >> RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos) & 0x8U) == 0) {
        ADC_C3_Freq = ADC_C1_Freq;
    } else {
        ADC_C3_Freq = ADC_C1_Freq >> (((Temp >> RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos) & 0x7U) + 1);
    }

    RST_CLK_Clocks->ADC_Frequency = ADC_C3_Freq;

    /* Compute ADCUI_CLK frequency */

    /* Select ADCUI_C1 from cpu_c1, PER_C1_Freq, CPU_C2_Freq, HSI_C1 cases */
    switch (Temp & RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_Msk) {
        case RST_CLK_ADCUI_CLK_CPU_C1:
            ADCUI_C1_Freq = CPU_C1_Freq;
            break;
        case RST_CLK_ADCUI_CLK_PER1_C1:
            ADCUI_C1_Freq = PER_C1_Freq;
            break;
        case RST_CLK_ADCUI_CLK_PLLCPU:
            ADCUI_C1_Freq = CPU_C2_Freq;
            break;
        case RST_CLK_ADCUI_CLK_HSI_CLK:
            ADCUI_C1_Freq = HSI_FREQUENCY_Hz;
            break;
    }

    if (((Temp >> RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos) & 0x8U) == 0) {
        ADCUI_C3_Freq = ADCUI_C1_Freq;
    } else {
        ADCUI_C3_Freq = ADCUI_C1_Freq >> (((Temp >> RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos) & 0x7U) + 1);
    }

    RST_CLK_Clocks->ADCUI_Frequency = ADCUI_C3_Freq;
}

/**
 * @brief  Checks whether the specified RST flag is set or not.
 * @param  RST_CLK_Flag - @ref RST_CLK_Flags_TypeDef - specifies the flag to check.
 * @retval @ref FlagStatus - The state of RST_FLAG (SET or RESET).
 */
FlagStatus RST_CLK_GetFlagStatus(RST_CLK_Flags_TypeDef RST_CLK_Flag)
{
    FlagStatus Status;

    /* Check the parameters */
    assert_param(IS_RST_CLK_FLAG(RST_CLK_Flag));

    /* Get the flag status on proper position */
    if ((MDR_RST_CLK->CLOCK_STATUS & (uint32_t)RST_CLK_Flag) != RESET) {
        Status = SET;
    } else {
        Status = RESET;
    }

    /* Return the flag status */
    return Status;
}

/** @} */ /* End of group RST_CLK_Exported_Functions */

/** @} */ /* End of group RST_CLK */

/** @} */ /* End of group __MDR32F2xQI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32F2xQI_rst_clk.c */

